app/controllers/teacher/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."teacher_id" = $1  [["teacher_id", 9]]
---
  def index
    @courses = Course.where(teacher_id: current_user.id)

SELECT "grades".* FROM "grades"
---
  def new
    @course = Course.new
    @grades = Grade.all