app/controllers/teacher/videos_controller.rb

  def create
    @video = Video.new(video.params)

    if @video.save
---
INSERT INTO "videos" ("video_data", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"