app/controllers/admin/users_controller.rb

  def new
    @user = User.new
    @grades = Grade.all
---
SELECT "grades".* FROM "grades"

  def create
    @user = User.new(user_params)
    @user.password = '1234567'

    if @user.save
      UserMailer.registration_confirmation(@user).deliver_now
      flash[:success] = 'You have created an user.'
      render json: @user
    else
      flash[:danger] = 'Something went wrong.'
      @grades = Grade.all
---
INSERT INTO "users" ("name", "email", "password_digest", "user_type", "registration_confirmed", "registration_token", "grade_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "grades".* FROM "grades"