app/views/teachers/dashboard.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."teacher_id" = $1  [["teacher_id", 9]]
---
      <div class='ui cards'>
        <% @teacher.courses.each do |course| %>