app/views/courses/show.html.erb

    <div class='ui cards stackable four wide column'>
    <% @course.teacher.courses[0...4].each do |course| %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."teacher_id" = $1  [["teacher_id", 9]]