app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)
    @course.teacher = current_user

    if @course.save!
---
INSERT INTO "courses" ("title", "teacher_id", "grade_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["teacher_id", 9], ["grade_id", 1], ["created_at", 2017-03-05 10:21:33 UTC], ["updated_at", 2017-03-05 10:21:33 UTC]]

  def set_course
    @course = Course.where('(id=?)', params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]