app/controllers/registration_confirmation_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."registration_token" = $1 LIMIT $2  [["registration_token", "wLMOD6G5-TY1rZnHkpz42w"], ["LIMIT", 1]]
---
  def show
    @user = User.find_by_registration_token(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$2uKVRJO7jt00.oUqLxf9eer98cbMFJqQKo9t7FxHF.gKKAR/mSdHG"], ["updated_at", 2017-03-07 05:31:32 UTC], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.password = user_params[:password]

    if @user.save