app/controllers/schools_controller.rb

SELECT  "users".* FROM "users" WHERE ((user_type ='teacher')) LIMIT $1  [["LIMIT", 1]]
---
  def show
    @teacher = User.find_by('(user_type =?)', 'teacher')