app/controllers/students_controller.rb

  def index
    @students = User.where('(user_type=?)' , 'student')
---
SELECT "users".* FROM "users" WHERE ((user_type='student'))