app/controllers/teachers_controller.rb

SELECT "users".* FROM "users" WHERE ((user_type='teacher' AND school_id=1))
---
  def index
    @teachers = User.where('(user_type=?)' , 'teacher')

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @teacher = User.find_by_id(params[:id])

SELECT  "grades".* FROM "grades" ORDER BY "grades"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "password_digest", "user_type", "grade_id", "school_id", "created_at", "updated_at", "registration_confirmed", "registration_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @teacher = User.new(teacher_params)
    @teacher.user_type = 'teacher'
    @teacher.grade = Grade.first
    @teacher.password = '1234567' if @teacher.password == nil
    if @teacher.save!