app/controllers/users_controller.rb

  def update
    @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Yi Sheng Lee"], ["updated_at", 2017-03-05 16:21:20 UTC], ["id", 9]]