app/controllers/videos_controller.rb

  def create
    @video = Video.new(video_params)

    if @video.save
---
INSERT INTO "videos" ("file_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["file_id", "4f69d29f2d0b43d1b656dfecf46f80302efc9d40be4342abd31f1b38784a"], ["created_at", 2017-03-06 10:57:47 UTC], ["updated_at", 2017-03-06 10:57:47 UTC]]